<!-- azurenoops/terraform-github-actions {"workspace":"default","backend_type":"azurerm","backend":"5e59765d32a5eba7ab38d8d171a1c4b7b203044a14022ffa9549071baebcbeae","plan_job_ref":"Job TF Plan #28 at https://github.com/CurtisSlone/STATIC_WEB_TF/actions/runs/4677289348","plan_hash":"58bd31048b411117d1a8defc75fccd9a3109f68d502212f42ebad0a353668e88","plan_text_format":"text","version":"99.0.0"} -->
Terraform plan in __src__
With backend config: `resource_group_name=ampe-eastus2-network-artifacts-dev-rg
storage_account_name=ampetfstatesarjuprr8y
container_name=ampetfdevscrjuprr8y
key=terraform.states`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_dns_cname_record.name must be replaced
-/+ resource "azurerm_dns_cname_record" "name" {
      ~ fqdn                = "test.www.slonesecurity.com." -> (known after apply)
      ~ id                  = "************************************************************************************************************************************************************************" -> (known after apply)
      ~ name                = "test" -> "www" # forces replacement
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change.
      ~ record              = (sensitive value)
      - tags                = {} -> null
      ~ zone_name           = "www.slonesecurity.com" -> "slonesecurity.com" # forces replacement
        # (2 unchanged attributes hidden)
    }

  # azurerm_dns_zone.dnszone must be replaced
-/+ resource "azurerm_dns_zone" "dnszone" {
      ~ id                        = "*************************************************************************************************************************************************************" -> (known after apply)
      ~ max_number_of_record_sets = 10000 -> (known after apply)
      ~ name                      = "www.slonesecurity.com" -> "slonesecurity.com" # forces replacement
      ~ name_servers              = [
          - "ns1-35.azure-dns.com.",
          - "ns2-35.azure-dns.net.",
          - "ns3-35.azure-dns.org.",
          - "ns4-35.azure-dns.info.",
        ] -> (known after apply)
      ~ number_of_record_sets     = 3 -> (known after apply)
      - tags                      = {} -> null
        # (1 unchanged attribute hidden)

      - soa_record {
          - email         = "azuredns-hostmaster.microsoft.com" -> null
          - expire_time   = 2419200 -> null
          - fqdn          = "www.slonesecurity.com." -> null
          - host_name     = "ns1-35.azure-dns.com." -> null
          - minimum_ttl   = 300 -> null
          - refresh_time  = 3600 -> null
          - retry_time    = 300 -> null
          - serial_number = 1 -> null
          - tags          = {} -> null
          - ttl           = 3600 -> null
        }
    }

Plan: 2 to add, 0 to change, 2 to destroy.
```
</details>

:memo: Plan generated in [TF Plan #28](https://github.com/CurtisSlone/STATIC_WEB_TF/actions/runs/4677289348)